// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().


// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

 //const min = Math.floor(Math.random() * 59);
// if (min < 15) {
//     alert(`${min} входить в першу чверть`);
// } else if (min < 30) {
//         alert(`${min} входить в другу чверть`);
//     }  else if (min < 45) {
//         alert(`${min} входить в третю чверть`);
//     } else {
//             alert(`${min} входить в четверту чверть`);
//     }


// Змінна num може набувати 4 значення: '1', '2', '3' або '4' 
// (запитуй це значення у користувача через prompt). 
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач 
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = +prompt('Enter a number');
// let result;
// switch (num) {
//   case 1:
//     result = 'зима';
//     break;
//   case 2:
//     result = 'весна';
//     break;
//   case 3:
//     result = 'лiто';
//     break;
//   case 4:
//     result = 'осiнь';
//     break;
//   default:
//     result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';
// }

// console.log(num);
// console.log(result);



// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'): 
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

//paddedString = "abc".padStart(8, "0");
// const minutes = Number(prompt('Введіть кількість хвилин:'));
// const hours = Math.floor(minutes / 60);
// const remainingMinutes = minutes % 60;


// console.log (`${String(hours).padStart(2, "0")}:${String(remainingMinutes).padStart(2, "0")}`);

// Number 5

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// const login = prompt('Введіть логін');

// if (login === 'Адмін') {
//   const password = prompt('Введіть пароль');
//   password === 'Я головний' ? alert('Добрий день!') : alert('Невірний пароль!');
// } else if (login === null || login === '') {
//   alert('Скасовано');
// } else {
//   alert('Я вас не знаю');
// }


// Number 6
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
// let counter = 0;

// while (counter <= 20) {
//   counter++;
//   console.log(`${counter}`);
// }

// Number 7
// function getNumbers(min, max) {
//   let sum = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(`${i}`);
//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }
//   return sum;
// }
// console.log(getNumbers(3, 10));


8/////
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.
// function min(a, b) {
//     if (typeof a !== 'number' || typeof b !== 'number') {
//         return 'Not a number!';
//     }
//     return a < b ? a : b;
// }



 9/////
// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true, 
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm 
// і повертає його результат (true/false).


//  let sum = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(`${i}`);
//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }
//   return sum;
// }
// console.log(getNumbers(3, 10));
//  2. Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз.
// Цикл повинен питати число, доки користувач не
// введе число більше 100, чи не натисне кнопку
// Cancel в prompt
// 3. Напишіть функцію, яка приймає адресу сайта url та перевіряє чи закінчується значення
// параметра символом /. Якщо ні, додайте до кінця
// значення url цей символ і поверніть оновлене значення з функції, але тільки в тому випадку,
// якщо в url є підрядок "my-site".
// В іншому випадку поверніть з функції адресу в незмінному вигляді

// const url = "https://my-site.com/about";



// function fizzBuzz(num) {
//   for (let i = 1; i <= num; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log(i, 'fizzbuzz');
//     } else if (i % 3 === 0) {
//       console.log(i, 'fizz');
//     } else if (i % 5 === 0) {
//       console.log(i, 'buzz');
//     }
//   }
// }

// fizzBuzz(16);






11
//  2. Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз.
// Цикл повинен питати число, доки користувач не
// введе число більше 100, чи не натисне кнопку
// Cancel в prompt
// const getNumber = () => {
//     let number;
//     do {
//         number = prompt("Введіть число більше 100");
//         if (number === null) {
//             return null;
//         }
//     } while (number <= 100);

//     return number;
// };
// console.log(getNumber());

12

// 3. Напишіть функцію, яка приймає адресу сайта url та перевіряє чи закінчується значення
// параметра символом /. Якщо ні, додайте до кінця
// значення url цей символ і поверніть оновлене значення з функції, але тільки в тому випадку,
// якщо в url є підрядок "my-site".
// В іншому випадку поверніть з функції адресу в незмінному вигляді

const url = "https://my-site.com/about";

function checkUrl(url) {
  if (url.endsWith("/")) {
    return url;
  } else if (url.includes("my-site")) {
    return url + "/";
  }
  return url;
}

console.log();
